#tap "derailed/k9s"
#tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/cask-fonts"
#tap "homebrew/core"

#brew "act"
#brew "argo"
#brew "argocd-autopilot"
#brew "awscli"
#brew "cpulimit"
#brew "derailed/k9s/k9s"
#brew "highlight"
#brew "kubectx"
#brew "octant"
#brew "pandoc"
#brew "parallel"
#brew "pass"
#brew "pdfsandwich"
#brew "pinentry-mac"
#brew "pre-commit"
#brew "pv"
#brew "pyenv"
#brew "ruby"
#brew "skaffold"
#brew "telnet"
#brew "tesseract-lang"
#brew "tfk8s"
#brew "yarn"
#brew "youtube-dl"
#brew "yt-dlp"
brew "ack"
brew "argocd"
brew "autojump"
brew "rustup"
brew "autossh"
brew "bmon"
brew "bottom"
brew "choose-gui"
brew "docker-compose"
brew "dog"
brew "duf"
brew "dust"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "go"
brew "gzip"
brew "helm"
brew "hugo"
brew "jq"
brew "kind"
brew "kustomize"
brew "lsd"
brew "macvim"
brew "neofetch"
brew "newsboat"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "python"
brew "python@3.11"
brew "python@3.8"
brew "ranger"
brew "rclone"
brew "renameutils"
brew "restic"
brew "rsync"
brew "stow"
brew "stress"
brew "terraform"
brew "terraformer"
brew "terragrunt"
brew "terrascan"
brew "tflint"
brew "tig"
brew "tldr"
brew "tmux"
brew "trivy"
brew "uv"
brew "vault"
brew "wget"

# cask "station"
#cask "adobe-acrobat-reader"
#cask "adoptopenjdk"
#cask "alfred"
#cask "barrier"
#cask "bluesnooze"
#cask "box-drive"
#cask "chromium"
#cask "citrix-workspace"
#cask "colorpicker-materialdesign"
#cask "dash"
#cask "disk-inventory-x"
#cask "dozer"
#cask "figma"
#cask "firefox"
#cask "font-sauce-code-pro-nerd-font"
#cask "gfxcardstatus"
#cask "meetingbar"
#cask "miro"
#cask "mosaic"
#cask "obs"
#cask "osxfuse"
#cask "rancher"
cask "aldente"
cask "anki"
cask "appcleaner"
cask "balenaetcher"
cask "bitwarden"
cask "calibre"
cask "chatgpt"
cask "coconutbattery"
cask "discord"
cask "docker"
cask "drawio"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
cask "iterm2"
cask "karabiner-elements"
cask "lm-studio"
cask "logseq"
cask "lulu"
cask "macfuse"
cask "microsoft-edge"
cask "microsoft-outlook"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "orion"
cask "plex"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "setapp"
cask "signal"
cask "slack"
cask "stats"
cask "tailscale"
cask "postman"
cask "todoist"
cask "utm"
cask "visual-studio-code"
cask "vmware-fusion"
cask "zoom"
