# Homebrew Bundle File
# Generated by merging Brewfile.base, Brewfile.extra, and Brewfile.casks

# Taps
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "supabase/tap"

# Formulae
brew "ack"                 # Text search tool
brew "autossh"            # SSH automation
brew "autojump"
brew "bmon"               # Bandwidth monitor
brew "bottom"             # System monitor
brew "docker-compose"     # Container orchestration
#brew "dog"                # DNS lookup tool
brew "duf"                # Disk usage utility
brew "dust"               # Disk usage analyzer
brew "fd"                 # Find alternative
brew "fish"               # Shell
brew "fzf"                # Fuzzy finder
brew "gcc"                # Compiler
brew "gnupg"              # Encryption
brew "git"                # Version control
brew "git-crypt"          # Git encryption
brew "git-lfs"            # Git large file storage
brew "go"                 # Go language
brew "gzip"               # Compression
brew "htop"               # Process monitor
brew "huggingface-cli"    # Hugging Face CLI
brew "hugo"               # Static site generator
brew "imagemagick"        # Image manipulation
brew "jq"                 # JSON processor
brew "nmap"               # Network scanner
brew "node"               # JavaScript runtime
brew "nvm"                # Node version manager
brew "neovim"
brew "vim"
brew "python"             # Python language
brew "renameutils"        # File renaming utilities
brew "restic"             # Backup tool
brew "rsync"              # File sync tool
brew "stow"               # Symlink farm manager
brew "stress"             # System stress tester
brew "pnpm"
brew "gh"
brew "tmux"               # Terminal multiplexer
brew "wget"               # File downloader
brew "argocd"             # Kubernetes CD
brew "helm"               # Kubernetes package manager
# brew "kind"               # Kubernetes in Docker
brew "kubectl"
brew "k9s"
brew "bat"                # Cat alternative
brew "ranger"
brew "sketchybar"         # Status bar
brew "kustomize"          # Kubernetes config
brew "terraform"          # Infrastructure as code
brew "terraformer"        # Infrastructure importer
brew "terragrunt"         # Terraform wrapper
brew "terrascan"          # Security scanner
brew "tflint"             # Terraform linter
brew "trivy"              # Vulnerability scanner
brew "choose-gui"         # GUI selection tool
brew "openjdk@17"         # Java runtime
brew "tig"               # Terminal UI for git
brew "git-filter-repo"    # Git filter repository
brew "nushell"    # Git filter repository
brew "luarocks"
brew "ffmpeg"             # Media handler
brew "newsboat"           # RSS reader
brew "pandoc"              # Document converter
brew "parallel"            # Parallel execution
brew "pinentry-mac"        # GPG pinentry
brew "rustic"              # Backup tool
brew "skaffold"            # Kubernetes dev tool
brew "supabase/tap/supabase"
brew "telnet"              # Network tool
brew "temporal"            # Workflow engine
brew "tfenv"               # Terraform version manager
brew "tldr"                # Simplified man pages
brew "uv"                  # Python package manager
brew "xq"                  # XML processor
brew "yarn"                # JavaScript package manager
brew "yq"                  # YAML processor
brew "yt-dlp"              # Video downloader

# Casks
cask "aerospace"          # Window manager
cask "anki"               # Flashcard app
cask "appcleaner"         # App uninstaller
cask "balenaetcher"       # USB writer
cask "bitwarden"          # Password manager
cask "beeper"          # Chat
cask "calibre"            # E-book manager
cask "chatgpt"            # AI chat
# cask "coconutbattery"     # Battery monitor
cask "discord"            # Chat
cask "docker-desktop"     # Container platform
cask "drawio"             # Diagramming
cask "google-chrome"      # Browser
cask "gcloud-cli"         # Cloud tools
cask "brave-browser"
# cask "tor-browser"
cask "google-drive"       # File sync
cask "gpg-suite"          # Encryption
cask "iterm2"             # Terminal
cask "karabiner-elements" # Keyboard customizer
cask "lm-studio"          # AI platform
cask "cursor"		  # Editor, VSCode derivative
cask "logseq"             # Note-taking
cask "lulu"               # Firewall
cask "macfuse"            # Filesystem
cask "linear-linear"
cask "notion"             # Workspace
cask "notion-calendar"    # Calendar
cask "obsidian"           # Note-taking
cask "postman"            # API tool
cask "raycast"           # Launcher
cask "setapp"            # App suite
cask "signal"            # Messaging
cask "slack"             # Team chat
cask "stats"             # System monitor
cask "tailscale-app"      # VPN
cask "todoist-app"        # Task manager
cask "utm"               # Virtual machines
cask "visual-studio-code" # Code editor
# cask "vmware-fusion"     # Virtual machines
# cask "zoom"              # Video calls
cask "reader"
