tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "ack"
brew "act"
brew "argo"
brew "argocd"
brew "argocd-autopilot"
brew "autojump"
brew "autossh"
brew "awscli"
brew "bmon"
brew "bottom"
brew "choose-gui"
brew "cpulimit"
brew "dog"
brew "duf"
brew "dust"
brew "exiftool"
brew "fd"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "go"
brew "helm"
brew "highlight"
brew "hugo"
brew "jq"
brew "kind"
brew "kubectx"
brew "kustomize"
brew "lsd"
brew "ruby"
brew "macvim"
brew "neofetch"
brew "newsboat"
brew "nmap"
brew "nvm"
brew "octant"
brew "pandoc"
brew "parallel"
brew "pass"
brew "pdfsandwich"
brew "pinentry-mac"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "python@3.8"
brew "ranger"
brew "rclone"
brew "renameutils"
brew "restic"
brew "rsync"
brew "skaffold"
brew "stow"
brew "stress"
brew "tailscale"
brew "telnet"
brew "terraform"
brew "terraformer"
brew "terragrunt"
brew "terrascan"
brew "tesseract-lang"
brew "tfk8s"
brew "tflint"
brew "tig"
brew "tldr"
brew "tmux"
brew "vault"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp"
brew "derailed/k9s/k9s"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "barrier"
cask "bluesnooze"
cask "box-drive"
cask "chromium"
cask "citrix-workspace"
cask "coconutbattery"
cask "colorpicker-materialdesign"
cask "dash"
cask "disk-inventory-x"
cask "dozer"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-sauce-code-pro-nerd-font"
cask "gfxcardstatus"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "karabiner-elements"
cask "logseq"
cask "macfuse"
cask "meetingbar"
cask "miro"
cask "mosaic"
cask "notion"
cask "obs"
cask "osxfuse"
cask "rancher"
cask "stats"
cask "visual-studio-code"
cask "vmware-fusion"
